1. Задание: создать DataFrame следующего вида

In [11]:
import pandas as pd


df = pd.DataFrame(
    {
        "ID": [1, 2, 3, 4, 5],
        "Name": [
            "John",
            "Mary",
            "James",
            "Emily",
            "Michael"
        ],
        "Age": [28, 35, 22, 40, 32],
        "City": [
            "New York",
            "Los Angeles",
            "Chicago",
            "San Francisco",
            "Seattle"
        ],
        "Occupation": [
            "Engineer",
            "Doctor",
            "Student",
            "Lawyer",
            "Software Developer"
        ],
    }
)
df

   ID     Name  Age           City          Occupation
0   1     John   28       New York            Engineer
1   2     Mary   35    Los Angeles              Doctor
2   3    James   22        Chicago             Student
3   4    Emily   40  San Francisco              Lawyer
4   5  Michael   32        Seattle  Software Developer

2. Задание: выведите на экран Series по ключу Occupation

In [12]:
df["Occupation"]

0              Engineer
1                Doctor
2               Student
3                Lawyer
4    Software Developer
Name: Occupation, dtype: object

3. Задание: создать Series под названием Surnames со следующей информацией

In [13]:
surnames = pd.Series(["Smith", "Johnson", "Davis", "Taylor", "Brown"], name="Surnames")
surnames

0      Smith
1    Johnson
2      Davis
3     Taylor
4      Brown
Name: Surnames, dtype: object

Конкатенируем наши объекты

In [14]:
df = pd.concat([df, surnames], axis=1)
df

   ID     Name  Age           City          Occupation Surnames
0   1     John   28       New York            Engineer    Smith
1   2     Mary   35    Los Angeles              Doctor  Johnson
2   3    James   22        Chicago             Student    Davis
3   4    Emily   40  San Francisco              Lawyer   Taylor
4   5  Michael   32        Seattle  Software Developer    Brown

Функция describe описывает все числовые данные в вашем DataFrame

*для отображения только Age, я обращаюсь к нужному ключу, а также добавляю метод конвертации в DataFrame для красивого отображения заголовков

In [17]:
df['Age'].describe().to_frame()

             Age
count   5.000000
mean   31.400000
std     6.841053
min    22.000000
25%    28.000000
50%    32.000000
75%    35.000000
max    40.000000